Tekla Open API Reference for Tekla Structures 2025
ModelObjectEnumerator.AutoFetch Property
 Indicates that the objects are fetched from the model when the enumerator is created. Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator. Warning: changing of TransformationPlane after creation of enumerator or during the enumeration requires a separate selection of object for refreshing the values. Property value is used for all enumerators in application
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool AutoFetch { get; set; }
Public Shared Property AutoFetch As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ModelObjectEnumerator Class
Tekla.Structures.Model Namespace